LonelyWolf/stm32/bike-computer/GUI.c
// Screen with RAW data packet
void GUI_Screen_SensorRAW(void) {
	uint8_t X,Y;

	// Frame
	UC1701_Fill(0x00);
	Rect(0,4,scr_width - 1,scr_height - 1,PSet);
	FillRect(3,0,scr_width - 4,8,PSet);
	PutStr5x7(19,1,"Sensor RAW data",CT_transp_inv);
	// Cadence data
	X = 5; Y = 10;
	X += PutStr5x7(X,Y,"CDC:",CT_transp) - 1;
	PutInt5x7(X,Y,nRF24_Packet.tim_CDC,CT_transp);
	// Speed data
	X = 5; Y += 9;
	X += PutStr5x7(X,Y,"SPD c:",CT_transp) - 1;
	X += PutInt5x7(X,Y,nRF24_Packet.cntr_SPD,CT_transp) + 8;
	X += PutStr5x7(X,Y,"t:",CT_transp) - 1;
	PutInt5x7(X,Y,nRF24_Packet.tim_SPD,CT_transp);
	// Packets lost
	X = 5; Y += 9;
	X += PutStr5x7(X,Y,"P.Lost:",CT_transp) - 1;
	X += PutInt5x7(X,Y,nRF24_Packet.packets_lost,CT_transp) + 5;
	// OBSERVER_TX
	X += PutStr5x7(X,Y,"OTX:",CT_transp) - 1;
	X += PutHex5x7(X,Y,nRF24_Packet.observe_TX,CT_transp);
	// Wakeups
	X = 5; Y += 9;
	X += PutStr5x7(X,Y,"Wake:",CT_transp) - 1;
	PutInt5x7(X,Y,nRF24_Packet.cntr_wake,CT_transp);
	X = 76;
	X += PutStr5x7(X,Y,"RT:",CT_transp) - 1;
	PutInt5x7(X,Y,nRF24_Packet.ride_time,CT_transp);
	// Battery
	X = 5; Y += 9;
	X += PutStr5x7(X,Y,"Battery:",CT_transp) - 1;
	PutChar5x7(X + PutIntF5x7(X,Y,nRF24_Packet.vrefint,2,CT_transp),Y,'V',CT_transp);
}

// Screen with current values (trip data)
void GUI_Screen_CurVal1(void) {
	uint8_t X,Y;

	// Frame
	UC1701_Fill(0x00);
	Rect(0,4,scr_width - 1,scr_height - 1,PSet);
	FillRect(3,0,scr_width - 4,8,PSet);
	PutStr5x7(22,1,"Current values",CT_transp_inv);

	X = 7; Y = 10;
	PutStr5x7(X,Y,"SPD:",CT_transp);
	PutIntF5x7(X + 23,Y,CurData.Speed,1,CT_transp);
	X += 54;
	PutStr5x7(X,Y,"CDC:",CT_transp);
	PutInt5x7(X + 23,Y,CurData.Cadence,CT_transp);
	X = 7; Y += 9;
	PutStr5x7(X,Y,"A.S:",CT_transp);
	PutIntF5x7(X + 23,Y,CurData.AvgSpeed,1,CT_transp);
	X += 54;
	PutStr5x7(X,Y,"A.C:",CT_transp);
	PutInt5x7(X + 23,Y,CurData.AvgCadence,CT_transp);
	X = 7; Y += 9;
	PutStr5x7(X,Y,"M.S:",CT_transp);
	PutIntF5x7(X + 23,Y,CurData.MaxSpeed,1,CT_transp);
	X += 54;
	PutStr5x7(X,Y,"M.C:",CT_transp);
	PutInt5x7(X + 23,Y,CurData.MaxCadence,CT_transp);
	X = 7; Y += 9;
	PutStr5x7(X,Y,"T.D:",CT_transp);
	PutInt5x7(X + 23,Y,CurData.TripDist,CT_transp);
	X = 7; Y += 9;
	PutStr5x7(X,Y,"Odo:",CT_transp);
	PutInt5x7(X + 23,Y,CurData.Odometer,CT_transp);
	X = 7; Y += 9;
	PutStr5x7(X,Y,"Time",CT_transp);
	GUI_PutTimeSec5x7(X + 26,Y,CurData.TripTime,CT_opaque);
}

// Screen with current values (BMP180 values)
void GUI_Screen_CurVal2(void) {
	uint8_t X,Y;

	// Frame
	UC1701_Fill(0x00);
	Rect(0,4,scr_width - 1,scr_height - 1,PSet);
	FillRect(3,0,scr_width - 4,8,PSet);
	PutStr5x7(46,1,"BMP180",CT_transp_inv);

	X = 4; Y = 10;
	X += PutStr5x7(X,Y,"Temperature:",CT_transp) - 1;
	GUI_PutTemperature5x7(X,Y,CurData.Temperature,CT_transp);
	X = 4; Y += 9;
	X += PutStr5x7(X,Y,"Min:",CT_transp) - 1;
	GUI_PutTemperature5x7(X,Y,CurData.MinTemperature,CT_transp);
	X = 67;
	X += PutStr5x7(X,Y,"Max:",CT_transp) - 1;
	GUI_PutTemperature5x7(X,Y,CurData.MaxTemperature,CT_transp);

	HLine(1,scr_width - 2,Y + 10,PSet);

	X = 4; Y += 14;
	X += PutStr5x7(X,Y,"Pressure:",CT_transp) - 1;
	GUI_PutPressure5x7(X,Y,CurData.Pressure,PT_mmHg,CT_transp);
	X = 4; Y += 9;
	X += PutStr5x7(X,Y,"Min:",CT_transp) - 1;
	PutIntF5x7(X,Y,CurData.MinPressure * 75 / 1000,1,CT_transp);
	X = 67;
	X += PutStr5x7(X,Y,"Max:",CT_transp) - 1;
	PutIntF5x7(X,Y,CurData.MaxPressure * 75 / 1000,1,CT_transp);
}

// Screen with current values (GPS values)
void GUI_Screen_CurVal3(void) {
	uint8_t X,Y;

	// Frame
	UC1701_Fill(0x00);
	Rect(0,4,scr_width - 1,scr_height - 1,PSet);
	FillRect(3,0,scr_width - 4,8,PSet);
	PutStr5x7(36,1,"GPS stats",CT_transp_inv);

	X = 4; Y = 10;
	X += PutStr5x7(X,Y,"Speed:",CT_transp) - 1;
	X += PutIntF5x7(X,Y,CurData.GPSSpeed,2,CT_transp);
	PutStr5x7(X,Y,"km/h",CT_transp);
	X = 4; Y += 9;
	X += PutStr5x7(X,Y,"Max:",CT_transp) - 1;
	X += PutIntF5x7(X,Y,CurData.MaxGPSSpeed,2,CT_transp);
	PutStr5x7(X,Y,"km/h",CT_transp);

	HLine(1,scr_width - 2,Y + 10,PSet);

	X = 4; Y += 14;
	X += PutStr5x7(X,Y,"Altitude:",CT_transp) - 1;
	X += PutInt5x7(X,Y,CurData.GPSAlt,CT_transp);
	PutChar5x7(X,Y,'m',CT_transp);
	X = 4; Y += 9;
	X += PutStr5x7(X,Y,"Min:",CT_transp) - 1;
	X += PutInt5x7(X,Y,CurData.MinGPSAlt,CT_transp);
	PutChar5x7(X,Y,'m',CT_transp);
	X = 4; Y += 9;
	X += PutStr5x7(X,Y,"Max:",CT_transp) - 1;
	X += PutInt5x7(X,Y,CurData.MaxGPSAlt,CT_transp);
	PutChar5x7(X,Y,'m',CT_transp);
}

// Draw speed with 'km/h' mark and AVG speed pace indicator
// input:
//   X, Y - left top corner coordinates
//   speed - speed value (max 999 -> 99.9 km/h)
//   avg - average speed value for pace indicator
// Size: 54 x 33
void GUI_DrawSpeed(int8_t X, int8_t Y, uint32_t speed, uint32_t avg) {
	FillRect(X,Y,X + 54,Y + 33,PReset);
//	GUI_DrawNumber(X,Y,speed / 10,2,0,DS_Big);
	GUI_DrawNumber(-(X + 29),Y,speed / 10,0,DS_Big);
	FillRect(X + 31,Y + 31,X + 33,Y + 33,PSet);
	GUI_SmallDig(X + 35,Y + 15,speed % 10);
	GUI_DrawBitmap(X + 34,Y + 3,20,10,&bmp_kmph[0]);
	if (speed > 0) {
		if (avg <= speed) {
			// Up pace arrow
			GUI_DrawBitmap(X + 46,Y + 18,9,13,&bmp_pace_arrow[0]);
		} else {
			// Down pace arrow
			GUI_DrawBitmap(X + 46,Y + 18,9,13,&bmp_pace_arrow[18]);
		}
	}
}

// Draw ride time (in seconds)
// input:
//   X, Y - left top corner coordinates
//   time - time in seconds (max value 359999 -> 99:59:59)
void GUI_DrawRideTime(uint8_t X, uint8_t Y, uint32_t time) {
	uint16_t hours;
	uint8_t minutes,seconds;

	hours   = time / 3600;
	minutes = (time / 60) % 60;
	seconds = time % 60;
	if (hours > 99) {
		hours   = 99;
		minutes = 59;
		seconds = 59;
	}

	// Hours
	GUI_SmallDig(X,Y,hours / 10);
	GUI_SmallDig(X + 10,Y,hours % 10);
	X += 20;
	FillRect(X,Y + 3,X + 1,Y + 7,PSet);
	FillRect(X,Y + 11,X + 1,Y + 15,PSet);
	X += 3;

	// Minutes
	GUI_SmallDig(X,Y,minutes / 10);
	GUI_SmallDig(X + 10,Y,minutes % 10);
	X += 20;
	FillRect(X,Y + 3,X + 1,Y + 7,PSet);
	FillRect(X,Y + 11,X + 1,Y + 15,PSet);
	X += 3;

	// Seconds
	GUI_SmallDig(X,Y,seconds / 10);
	GUI_SmallDig(X + 10,Y,seconds % 10);
}

// Draw graph
// input:
//   X, Y - top left corner coordinates
//   W, H - width and height of graph
//   data - pointer to array with graph values (must be same or less size of graph width)
//   GraphType - type of graph (GT_dot, GT_fill, GT_line)
void GUI_DrawGraph(uint8_t X, uint8_t Y, uint8_t W, uint8_t H, const int16_t* data, GraphType_TypeDef GraphType) {
	uint8_t i,bY,pY,YY,offset;
	int16_t min,max;
	float mY;

