LonelyWolf/stm32/bike-computer/GUI.c
	return X - pX;
}

// Print temperature value with Celsius sign
// input:
//   X,Y - top left coordinates of text
//   temperature - temperature value in Celsius degree
//   CharType - character drawing style
uint8_t GUI_PutTemperature5x7(uint8_t X, uint8_t Y, int32_t temperature, CharType_TypeDef CharType) {
	uint8_t pX = X;

	if (temperature < 0) {
		HLine(X,X + 2,Y + 3,PSet);
		temperature *= -1;
		X += 4;
	}
	X += PutInt5x7(X,Y,temperature / 10,CharType);

	// Decimal point
	Rect(X,Y + 5,X + 1,Y + 6,PSet);
	X += 3;

	// Temperature fractional
	X += PutInt5x7(X,Y,temperature % 10,CharType);

	// Celsius degree sign
	HLine(X + 1,X + 2,Y,PSet);
	HLine(X + 1,X + 2,Y + 3,PSet);
	VLine(X,Y + 1,Y + 2,PSet);
	VLine(X + 3,Y + 1,Y + 2,PSet);
	PutChar5x7(X + 5,Y,'C',CharType);

	return X - pX + 10;
}

// Draw vertical menu with scrolling
// input:
//   X,Y - top left menu corner coordinates
//   W,H - width and height of menu
//   Menu - pointer to Menu_TypeDef structure, containing menu
//   StartPos - start menu position
// return:
//   selected menu position or 0xff if "Escape" key pressed
uint8_t GUI_Menu(uint8_t X, uint8_t Y, uint8_t W, uint8_t H, const Menu_TypeDef *Menu,
		uint8_t StartPos) {
	uint8_t i;
	int8_t scrPos; // Cursor position related to screen
	int8_t scrOfs; // Menu scroll (number of first displayed item)
	uint8_t xx,yy;
	uint8_t Cr; // Right side of menu cursor
	uint8_t miYoffs; // First menu item vertical offset
	uint8_t sbTH; // Height of scrollbar thumb
	uint8_t sbH; // Height of scrollbar
	uint8_t sbTY; // Vertical position of scrollbar thumb
	uint8_t scrItems; // Visible menu items on screen

	// Compute locals for less further calculations
	Cr = X + W - 3;
	scrItems = (H - 4) / MenuItemHeight;
	if (scrItems < Menu->NumItems) {
		sbTH = ((H - 5) * scrItems ) / Menu->NumItems;
		if (sbTH < 2) sbTH = 2;
		Cr -= 4;
		sbH = H - 5;
	} else {
		sbTH = 0;
		sbH  = 0;
	}
	if (scrItems > Menu->NumItems) scrItems = Menu->NumItems;
	miYoffs = ((H - 6 - (scrItems * MenuItemHeight)) / 2) - 1;

	if (StartPos > Menu->NumItems) StartPos = 0;
	if (StartPos >= scrItems) {
		if (StartPos <= Menu->NumItems - scrItems) {
			scrPos = (scrItems * StartPos) / Menu->NumItems;
			scrOfs = StartPos - scrPos;
		} else {
			scrOfs = Menu->NumItems - scrItems;
			scrPos = StartPos - scrOfs;
		}
	} else {
		scrPos = StartPos;
		scrOfs = 0;
	}

	// Menu frame
	Rect(X,Y,X + W - 1,Y + H - 1,PSet);

	while(1) {
		// Clear menu background
		FillRect(X + 1,Y + 1,X + W - 2,Y + H - 2,PReset);

		// Menu items
		yy = Y + 4 + miYoffs;
		for (i = scrOfs; i < scrOfs + scrItems; i++) {
			xx = X + 5;
			// If MenuAlign given something except MA_left - it will be centered
			if (Menu->MenuAlign == MA_left) {
				sbTY = 0;
			} else {
				sbTY = ((Cr - X - 4) / 2) - (stringlen(Menu->Items[i].ItemName) * 3);
			}
			if (i - scrOfs == scrPos) {
				// Menu item under cursor
				FillRect(X + 2,yy,Cr,yy + MenuItemHeight - 1,PSet);
				PutStr5x7(xx + sbTY,yy + 1,Menu->Items[i].ItemName,CT_transp_inv);
			} else {
				// Menu item
				PutStr5x7(xx + sbTY,yy + 1,Menu->Items[i].ItemName,CT_opaque);
			}
			yy += MenuItemHeight;
		}

		// Scrollbar
		if (sbH > 0) {
			sbTY = Y + 2 + (((scrPos + scrOfs) * (sbH - sbTH)) / (Menu->NumItems - 1));
			VLine(X + W - 4,Y + 2,Y + 2 + sbH,PSet);
			VLine(X + W - 5,sbTY,sbTY + sbTH,PSet);
			VLine(X + W - 3,sbTY,sbTY + sbTH,PSet);
		}

		UC1701_Flush();

		// Wait for key press
		while (!BTN[0].cntr && !BTN[1].cntr && !BTN[2].cntr && !BTN[3].cntr &&
				BTN[0].state != BTN_Hold && BTN[1].state != BTN_Hold) {
//		    PWR->CR |= 1 << 2; // Clear the WUF wakeup flag
//		    __WFI();
		}

		// Up button
		if (BTN[0].cntr || BTN[0].state == BTN_Hold) {
			scrPos--;
			if (scrPos < 0) {
				scrPos = 0;
				scrOfs--;
				if (scrOfs < 0) {
					if (Menu->MenuScroll == MS_normal) {
						scrOfs = 0;
						scrPos = 0;
					} else {
						scrOfs = Menu->NumItems - scrItems;
						scrPos = scrItems - 1;
					}
				}
			}
			BTN[0].cntr = 0;
		}

		// Down button
		if (BTN[1].cntr || BTN[1].state == BTN_Hold) {
			scrPos++;
			if (scrPos > scrItems - 1) {
				scrPos = scrItems - 1;
				scrOfs++;
				if (scrOfs > Menu->NumItems - scrItems) {
					if (Menu->MenuScroll == MS_normal) {
						scrPos = scrItems - 1;
						scrOfs = Menu->NumItems - scrItems;
					} else {
						scrPos = 0;
						scrOfs = 0;
					}
				}
			}
			BTN[1].cntr = 0;
		}

		// "Enter" button
		if (BTN[2].cntr) {
			BTN[2].cntr = 0;
			return scrPos + scrOfs;
		}

		// "Escape" button
		if (BTN[3].cntr) {
			BTN[3].cntr = 0;
			return 0xff;
		}

	}
}

// Adjust numeric value with up/down buttons
// input:
//   X - left horizontal coordinate of dialog
//       if this value is negative -> dialog right horizontal coordinate
//   Y - top vertical coordinate of dialog
//       if this value is negative -> dialog bottom vertical coordinate
//   W - width of dialog (zero for auto size)
//   H - height of dialog (zero for auto size)
//   Value - start numeric value
//   Min - minimum value
//   Max - maximum value
//   Step - step change of numeric value
//   unit - unit to add to value
//   CallBack - pointer to function, which will be called on every Value change
void GUI_NumericScroll(int8_t X, int8_t Y, uint8_t W, uint8_t H, int32_t *Value,
		int32_t Min, int32_t Max, int32_t Step, char *unit, funcPtr_TypeDef CallBack) {
	uint8_t i;
	uint8_t vY; // Numeric value vertical coordinate
	uint8_t mid; // Middle horizontal position
	int32_t val = *Value; // Value to change
	uint8_t frame_width = W;
	uint8_t frame_height = H;

	// Check range
	if (val > Max || val < Min) val = Min + ((Max - Min) >> 1);

	// Calculate dialog width
	if (W == 0) {
		i = stringlen(unit) + numlen(Min);
		mid = stringlen(unit) + numlen(Max);
		if (i > mid) mid = i;
		frame_width = (mid * 6) + 3;
	}

	// Calculate dialog height
	if (H == 0) frame_height = 29;

	// If X negative -> adjust dialog left horizontal coordinate
	if (X < 0) X = (-1 * X) - frame_width;

