LonelyWolf/stm32/bike-computer/GUI.c
	// If Y negative -> adjust dialog top horizontal coordinate
	if (Y < 0) Y = (-1 * Y) - frame_height + 1;

	// Middle of dialog
	vY = Y + ((frame_height - 4) / 2) - 1;
	mid = X + (frame_width / 2) + 1; // Middle of the dialog window

	// Dialog frame
	Rect(X,Y,X + frame_width,Y + frame_height - 1,PSet);

	while(1) {
		// Call a callback function
		if (CallBack) CallBack(val);

		// Clear dialog background
		FillRect(X + 1,Y + 1,X + frame_width - 1,Y + frame_height - 2,PReset);

		// Draw up/down arrows
		for (i = 6; i > 0; i --) {
			if (val + Step <= Max) HLine(mid - i,mid + i - 1,vY + i - 10,PSet);
			if (val - Step >= Min) HLine(mid - i,mid + i - 1,vY - i + 16,PSet);
		}

		// Draw value
		i = mid - ((stringlen(unit) + numlen(val)) * 3);
		FillRect(X + 1,vY - 2,X + frame_width - 1,vY + 8,PSet);
		i += PutInt5x7(i,vY,val,CT_transp_inv) + 1;
		PutStr5x7(i,vY,unit,CT_transp_inv);
		UC1701_Flush();

		// Wait for key press
		while (!BTN[0].cntr && !BTN[1].cntr && !BTN[2].cntr && !BTN[3].cntr &&
				BTN[0].state != BTN_Hold && BTN[1].state != BTN_Hold) {
//		    PWR->CR |= 1 << 2; // Clear the WUF wakeup flag
//		    __WFI();
		}

		// Up button
		if (BTN[0].cntr || BTN[0].state == BTN_Hold) {
			val += Step;
			if (val > Max) val = Max;
			BTN[0].cntr = 0;
		}

		// Down button
		if (BTN[1].cntr || BTN[1].state == BTN_Hold) {
			val -= Step;
			if (val < Min) val = Min;
			BTN[1].cntr = 0;
		}

		// "Enter" button
		if (BTN[2].cntr) {
			BTN[2].cntr = 0;
			*Value = val;
			if (CallBack) CallBack(*Value);
			return;
		}

		// "Escape" button
		if (BTN[3].cntr) {
			BTN[3].cntr = 0;
			// Restore old value by calling callback function with original value
			if (CallBack) CallBack(*Value);
			return;
		}
	}
}
